Revit 2026 API

# BuiltInFailuresSlantedColumnFailures Class

---

Failures about SlantedColumn.

SystemObject Autodesk.Revit.DBBuiltInFailuresSlantedColumnFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SlantedColumnFailures
```
```vb
Public NotInheritable Class SlantedColumnFailures
```
```cpp
public ref class SlantedColumnFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SlantedColumnFailures = class end
```

The BuiltInFailuresSlantedColumnFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotCutParallelToLocationCurve | Cut plane of slanted column end is parallel to the location curve. |
|  | SlantedColumnCannotCutEnd | Unable to trim slanted column end geometry to desired condition. |
|  | SlantedColumnCannotCutEndWarn | Unable to trim slanted column end geometry to desired condition. |

#### Reference

Autodesk.Revit.DB Namespace